In [6]:
import pandas as pd
df=pd.read_csv('sample.csv')
df

   sno   sname           sadd  smarks
0  101   neeha          vizag     100
1  102   mouni            Akp     900
2  103   priya          vizag     100
3  104    siri     srikakulam     200
4  105    rama   vizianagaram     150
5  106  jyothi  yellamanchili      70

In [7]:
g=df.groupby('sadd')
g

In [8]:
for i,j in g:
    print(i)
    print(j)

Akp
   sno  sname sadd  smarks
1  102  mouni  Akp     900
srikakulam
   sno sname        sadd  smarks
3  104  siri  srikakulam     200
vizag
   sno  sname   sadd  smarks
0  101  neeha  vizag     100
2  103  priya  vizag     100
vizianagaram
   sno sname          sadd  smarks
4  105  rama  vizianagaram     150
yellamanchili
   sno   sname           sadd  smarks
5  106  jyothi  yellamanchili      70

In [10]:
g.get_group('vizag')

   sno  sname   sadd  smarks
0  101  neeha  vizag     100
2  103  priya  vizag     100

# Merging

In [45]:
import pandas as pd
d1={
    'a':[1,2,3],
    'b':['a','b','c']
}
f=pd.DataFrame(d1)
f

   a  b
0  1  a
1  2  b
2  3  c

In [46]:
d2={
    'a':[4,5,6],
    'b':['a','e','c'],
    'c':['ab','cd','ef']
}
p=pd.DataFrame(d2)
p

   a  b   c
0  4  a  ab
1  5  e  cd
2  6  c  ef

In [47]:
df=pd.concat([f,p],ignore_index=True)
df

C:\Users\creo\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   a  b    c
0  1  a  NaN
1  2  b  NaN
2  3  c  NaN
3  4  a   ab
4  5  e   cd
5  6  c   ef

In [48]:
pd.merge(f,p,how="outer")

   a  b    c
0  1  a  NaN
1  2  b  NaN
2  3  c  NaN
3  4  a   ab
4  5  e   cd
5  6  c   ef

In [49]:
pd.merge(f,p,how="inner",on="b")

   a_x  b  a_y   c
0    1  a    4  ab
1    3  c    6  ef

In [50]:
pd.merge(f,p, how="left",on="b")

   a_x  b  a_y    c
0    1  a  4.0   ab
1    2  b  NaN  NaN
2    3  c  6.0   ef

In [51]:
pd.merge(f,p, how="right",on="b")

   a_x  b  a_y   c
0  1.0  a    4  ab
1  3.0  c    6  ef
2  NaN  e    5  cd

In [54]:
p.set_index(p.iloc[0].values) ## printing first row values as index column- 0->4,1->a,2->ab is printed

    a  b   c
4   4  a  ab
a   5  e  cd
ab  6  c  ef